"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
# код вводити тут
import math


old = 45
name = "Tetyana"
is_student = True
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
name = "John" #цифра на початку є помилкою
age = 25 #правильна змінна для віку
price = 100 #не можна знаки в назвах
class_1 = "Math"# class є зарезервованим словом, додала _1
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
# код вводити тут
max_students = 30

"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
# код вводити тут
course_name = "Python Programming"
course_hours = 40
course_price = 500

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
# код вводити тут
cost = course_hours / course_price

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
# код вводити тут
decimal_number = 42
binary_number = 0b101010
hexadecimal_number = 0x2A
octal_number = 0o52

"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
# код вводити тут
a = 17
b = 5
print(a + b)  #сума
print(a - b)  #різниця
print(a * b)  #множення
print(a / b)  #ділення зі значенням після коми
print(a // b)  #ділення без показання залишку
print(a % b)  #залишок від ділення
print(a ** b)  #піднесення до степеня

"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
area = math.pi* 7.5**2
print(area)

"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
# код вводити тут
 50%7
1
33%7
5
14%7
0
"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут
area_chorne_more = 436402
area_azov_more = 37800
total_area = area_chorne_more + area_azov_more
print(f"Площа Чорного та Азовського морів разом становить {total_area} км2.")
"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
# код вводити тут
name = "Тетяна Миколаївна"
print(len(name))
17
print(name[0])
T
print(name[16])
a
print(name[-1])
a

"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
# код вводити тут
text = "Would you tell me, please, which way I ought to go from here?"
print(text[:6])
print(text[-11:])

"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
# код вводити тут
text = """
Ті, хто працює граючись, розслаблено - здатні працювати ефективно\
 і творчо. Ті, хто працює безперервно, з примусу й у стресі, - працюють без радості
"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
# код вводити тут
text_1 = "Hello!"
text_2 = "Wold!"
print (f"{text_1} {text_2}")
print (text_1 + "," + text_2)
print (text_1 + "\n" + text_2)

**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут
text = "Вона сказала: \"Вітаю! Коли зустрінемося поговоримо?\" - \"Зізвонимося на тижні!\",- відповіла подруга "



**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
# код вводити тут
name = input("Введіть ваше ім'я: ")
age = input("Введіть ваш вік: ")
print(f"Привіт, {name}! Тобі {age} років.")

"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# код вводити тут
vsogo_foto = 232
foto_na_storinku = 8
treba_storinki = vsogo_foto // foto_na_storinku
zalishok= vsogo_foto % foto_na_storinku
if zalishok > 0:
    treba_storinki += 1
print(f"Ігорю знадобиться {treba_storinki} сторінок, щоб вклеїти всі фото.")

"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
# код вводити тут
favorite_color = input("Введіть ваш улюблений колір: ")
favorite_number = input("Введіть ваше улюблене число: ")
print(f"Ваш улюблений колір - {favorite_color}, а ваше улюблене число - {favorite_number}.")


"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
# код вводити тут
Sklad_1_i_2 = 250449
Sklad_2_i_3 = 222950
vsogo = 375291
Sklad_1 = vsogo - Sklad_2_i_3
Sklad_3 = vsogo - Sklad_1_i_2
Sklad_2 = vsogo - Sklad_1 - Sklad_3
print(f"На першому складі {Sklad_1} товарів, на другому складі {Sklad_2} товарів, а на третьому складі {Sklad_3} товарів.")

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
# код вводити тут
plata_mis = 1179
kilkist = 18
vartist = plata_mis * kilkist
print(f"Вартість комп’ютера становить {vartist} грн.")
